In [1]:
import pandas as pd

In [10]:
df = pd.DataFrame([[1, 'A', 2, 3], [4, 'A', 5, 6], [7, 'B', 8, 9], [10, 'C', 11, 12]])
df

    0  1   2   3
0   1  A   2   3
1   4  A   5   6
2   7  B   8   9
3  10  C  11  12

In [11]:
df[1].map({'A':0, 'B':1})

0    0.0
1    0.0
2    1.0
3    NaN
Name: 1, dtype: float64

In [12]:
df.replace(['A', 'B'], [1, 0])

    0  1   2   3
0   1  1   2   3
1   4  1   5   6
2   7  0   8   9
3  10  C  11  12